IDEA Open Model
CalculationSetup Properties
Compatible with IDEA StatiCa v 10.1
The CalculationSetup type exposes the following members.
Properties
Name | Description
CrossSectionCharacteristics
 Cross section charactertistics
Detailing
 Detailing
Fatigue
 ULS fatigue
MNKappaDiagram
 M-N-κ diagram
SlsCrack
 SLS crack
SlsDeflections
 SLS deflections
SlsStiffnesses
 SLS stiffnesses
SlsStressLimitation
 SLS stress limitation
UlsDiagram
 ULS capacity N-M-M
UlsInteraction
 Uls interaction
UlsResponse
 ULS response
UlsShear
 ULS shear
UlsTorsion
 ULS torsion
Top
See Also
Reference
CalculationSetup Class
IdeaRS.OpenModel.Concrete Namespace